{
  "form": "In my free time, I enjoy several activities. Firstly, I love cooking and experimenting with different recipes. Lately, I've been exploring Korean cuisine and trying to learn traditional Korean dishes. Secondly, I enjoy exploring nature and going on hikes. I find it refreshing and it helps me relax. Recently, I've been researching popular hiking trails in Korea and planning to visit some scenic locations. Lastly, I enjoy reading books, especially novels and non-fiction. Recently, I've been interested in learning more about Korean history and culture through literature. During my exchange in Korea, I have several expectations and things I am looking forward to. Firstly, I am excited to immerse myself in the Korean language and improve my proficiency. I hope to take language classes and engage in conversations with local students to enhance my language skills. Secondly, I am eager to experience the vibrant Korean food scene. I want to taste various street foods, visit traditional markets, and try authentic Korean dishes. Lastly, I am interested in exploring Korean culture and traditions, such as attending cultural festivals, visiting historical landmarks, and experiencing Korean customs firsthand. My lifestyle revolves around maintaining a balance between my studies and personal well-being. I value education and strive to excel academically, dedicating time to studying and completing assignments. However, I also believe in the importance of taking care of myself physically and mentally. I prioritize regular exercise, engaging in activities like jogging, yoga, and swimming to stay fit. Additionally, I allocate time for relaxation and hobbies, such as reading, cooking, and spending time with friends. I value open-mindedness, cultural diversity, and respect for others' perspectives. I believe in embracing new experiences, learning from different cultures, and fostering meaningful connections with people from diverse backgrounds.",
  "Fitness": ["hiking","exercise"],
  "Creativity": ["reading", "language"],
  "Food":["cooking"],
  "Tech":[],
  "Charity":[],
  "Music":[],
  "Ent": []
}

